{"meta": {"title": "Content Separation", "author": "Jeremy Greer", "date": "Sun May 20 19:23:25 EDT 2018"}, "content": "\ntitle: Content Separation\nauthor: Jeremy Greer\ndate: Sun May 20 19:23:25 EDT 2018\n\n- ---\n\nThis idea that content should be separate from structure is really resonating\nwith me.  Sure, it's only been a couple hours, but whatever.\n\nSo instead of kicking back and wearing a smug grin because I know the best way\nto do something, it's time to give it a whirl.  Maybe it's a stupid idea and\nI'm too ignorant right now to understand why.\n\n- ---\n\nI've got to realize that little things like the --- above is sybolism.  That's\na convention from Markdown, but it's also a generic way to show a break in\nthought.  It's easy to argue that it's structure.  What other things are there?\n\n* Timestamp - That's a convention.  It may not always be present.  What if\n  it's in a different part of the document?  It will always make sense in\n  text, but it may be hard to find and parse reliably for a translator, a\n  process that molds the content into the structure.\n\n* Title - This is similar to the timestamp.  It's probably near the same place\n  all the time, most likely separated with whitespace, but maybe not.  Both of\n  these are meta info about the document, not the actual document.\n\nThe simplest solution for including meta data would be to provide a meta\nsection.  It would need to follow some type of convention, but it wouldn't\nneed to be cryptic.\n\n- ---\ntitle: Something Really Nifty\nauthor: Jeremy Greer\ndate: Sun May 20 19:23:25 EDT 2018\n- ---\n\nYou could argue that this is _not_ part of the content.  That is true, I\nguess, but then who else owns this info?  What if you found the content\nfloating around the Sargasso Sea?  How would you know who made it and when it\nwas made?  To that end, it would probably be a good idea to include a GPG\nsignature to verify the content is authentic.\n\n- ---\n\nI've been including a couple other Markdown inspired conventions here out of\nhabit.  They're still meaningful in text, even when the reader doesn't know\nMarkdown.  Plain text is allowed to have symbols.  We do all the time, like\npunctuation.  Hell, text is just a bunch of symbols.\n\nTo clarify, I guess we're looking at building transformers that can do the\nheavy lifting.  The author should not be concerned with conventions for the\nconvenience of some future interpreter.  The onus is on the transformer to\nunderstand the content.\n\n- ---\n\nI really like this idea.  It frees the content from worrying about structure\nconventions.  If there are conventions, the translator should be able to pick\nthem up and work with them.  Any that get missed should end up as text and,\nassuming they had meaning in the text-only form, would still have meaning.\n\n- ---\n\nOne other aspect I can't account for is accessories that an author would like\nto include.  Initially, I thought of links and images, but those are really\njust references.  A link seems easy enough to find and convert to an anchor\ntag.  How would you handle an image, though?  It's just another url.  The\ntranslator could fetch it and check the file type or you could guess based on\nthe url (check for an extension).  Maybe a contextual guess would work.\n\nOr maybe you don't have to preemptively solve every possible problem before\ntrying something out.  I just said above that it was the responsibility of the\ntranslator to interpret the content.\n\nAs a general rule of thumb, the content should always be able to stand alone.\nThat's where the ideas and information reside.  All the rest is just different\nways to display it.\n"}